In [4]:
import pandas as pd

In [8]:
person = {
    "name" : ["James Bond", "Tim Cook", "Alan Smith", "John Cena"],
    "age" : [45, 65, 30, 55],
    "city" : ["London", "LA", "NY", "NY"]
}

type(person)

dict

In [6]:
print(person)

{'name': ['James Bond', 'Tim Cook', 'Alan Smith'], 'age': [45, 65, 30], 'city': ['London', 'LA', 'NY']}

In [13]:
df = pd.DataFrame(person)
df

         name  age    city
0  James Bond   45  London
1    Tim Cook   65      LA
2  Alan Smith   30      NY
3   John Cena   55      NY

In [16]:
df.head(2)

         name  age    city
0  James Bond   45  London
1    Tim Cook   65      LA

In [19]:
df[df["age"] >= 45]

         name  age    city
0  James Bond   45  London
1    Tim Cook   65      LA
3   John Cena   55      NY

In [46]:
import seaborn as sns
df = sns.load_dataset("titanic")
df.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [44]:
num_female = len(df[df["sex"] == "female"])
print(f"The numbmber of female passengers on board are: {num_female}")

The numbmber of female passengers on board are: 314

In [45]:
df["sex"].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [52]:
print(f"The average age of passengers on board is: {df["age"].mean():.2f}")

The average age of passengers on board is: 29.70

In [54]:
print(f"The total fare paid by passengers is: {df["fare"].sum():.2f}")

The total fare paid by passengers is: 28693.95

## Creating and Loading DataFrames
- Create a DataFrame manually with workouts data activity and duration. Make at least 5 rows.
- Load the CSV from photos.csv into a DataFrame. Print the first 5 rows.

In [62]:
workouts = {
    "activity" : ["Bench Press", "Squats", "Push Ups", "Situps", "Dead Lift"],
    "duration" : [10, 25, 30, 30, 45]
}

photos = pd.read_csv("photos.csv")

photos.head()

df = pd.DataFrame(workouts)

## Accessing Data

- Get the second row from your workouts DataFrame (remember: Python uses 0-based indexing).

- Extract the activity column and print all unique activity names.

- Get the duration value from the third workout (combining row and column access).

- What happens if you try to access a row that doesn't exist? Try it and note the error.

- What happens if you try to access a column that doesn't exist? Try it and note the error.

In [73]:
# ilock is the method to get a specific row
df.iloc[1]

# .unique() is the method to get all unique names from a df
print(df["activity"].unique())

# printing the duration for the third workout
print(df.iloc[2]["duration"])

# printing a row that dosnt exist throws an out of bounds excepention
# print(df.iloc[9])

# pringint a column that dosnt exist gives an index error
# print(df["dosnt exist"])

['Bench Press' 'Squats' 'Push Ups' 'Situps' 'Dead Lift']
30

## Extracting Columns & Statistics

- Extract the duration column from your workouts DataFrame and store it in a variable called durations.

- Work with the durations Series to find: .mean(), .sum(), .max(), .min().

- Calculate the range (difference between max and min) of workout durations.

- For the photos dataset, extract a numeric column and calculate its median using .median().

- Get the value counts of the Subject from the photos DataFrame

- Calculate its median number of photos per subject using .median()

In [ ]:
durations = df["duration"]

# Prints the average
print(durations.mean())

# Prints the sun
print(durations.sum())

# Prints the maximum number
print(durations.max())

# Prints the minimum number
print(durations.min())

# Calculating the range
print(durations.max() - durations.min())

# Finds the median
print(df["duration"].median)
photos["Date"] = pd.to_datetime(photos["Date"])

print(photos["Date"].median())

# Gets the value counts of the subject from the photos dataframe
print(photos["Subject"].count())

# Calculating the median number of photos per subject using .median

28.0
140
45
10
35
<bound method Series.median of 0    10
1    25
2    30
3    30
4    45
Name: duration, dtype: int64>
2023-01-02 12:00:00
100